/* element = document.getElementById(id); => Вызывает элемент по его ID
 * element = document.querySelector(selectors); => Вызывает первый элемент, совпадающий 
        по селектору. Возвращает null, если ничего не найдено. 
 * elementList = document.querySelectorAll(selectors); => Возвращает статический NodeList.
 *      NodeList - статическая таблица не является массивом, содержит в себе все элементы, 
 *      совпадающие селектору. Возвращает пустой NodeList, если ничего не найдено. 
 * document.getElementsByClassName() => Возвращает итерируемый объект всех дочерних классов
 *      указанного элемента. 
 * var elements = document.getElementsByTagName(name); => Возвращает HTMLCollection элементов
 * с указаным именем тега. Поиск осуществляется по всему документу, включая корневой узел.
 * —————————————————————————————————————————————————————————————————————————————————————————————————
 * 
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */
